//
//  CTAssetsPicker.strings
//  Nextcloud iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//

/* Navigation bar buttons */
"Cancel" = "Mégsem";
"Done" = "Kész";

/* Default title */
"Photos" = "Fényképek";

/* No. of selected */
"%@ Photo Selected" = "%@ fénykép kiválasztva";
"%@ Photos Selected" = "%@ fénykép kiválasztva";
"%@ Video Selected" = "%@ videó kiválasztva";
"%@ Videos Selected" = "%@ videó kiválasztva";
"%@ Items Selected" = "%@ elem kiválasztva";

/* Grid view footer */
"%@ Photos" = "%@ fénykép";
"%@ Videos" = "%@ videó";
"%@ Photos, %@ Videos" = "%1$@ fénykép, %2$@ videó";

/* Assets index */
"%@ of %@" = "%1$@ / %2$@";

/* Messages if privacy is not granted */
"This app does not have access to your photos or videos." = "Ez az app nem fér hozzá a képeidhez és videóidhoz.";
"You can enable access in Privacy Settings." = "Az adatvédelmi beállításokban adhatsz rá engedélyt.";

/* Messages if no assets */
"No Photos or Videos" = "Nincs fénykép vagy videó";

/* The parameter will be replaced by the device model name */
"You can take photos and videos using the camera, or sync photos and videos onto your %@\nusing iTunes." = "Készíthetsz képeket a kamerával, vagy szinkronizálhatsz képeket, videókat erre: %@\n iTunes segítségével.";
"You can sync photos and videos onto your %@ using iTunes." = "Szinkronizálhatod a képeid és videóidat erre: %@ iTunes segítségével.";

/* Accessibility labels */
"Play" = "Lejátszás";
"Select" = "Kiválaszt";
"Deselect" = "Kijelölés megszüntetése";

/* Video duration spell out */
"hours" = "óra";
"hour" = "óra";
"minutes" = "perc";
"minute" = "perc";
"seconds" = "másodperc";
"second" = "másodperc";

/* Error message of playing stream video */
"Cannot Play Stream Video" = "Videó folyam nem lejátszható";
"OK" = "OK";
